Revit 2024 API
AnalysisDisplayStyle.GetLegendSettings Method
 Get legend settings object from the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public AnalysisDisplayLegendSettings GetLegendSettings()
Visual Basic
Public Function GetLegendSettings As AnalysisDisplayLegendSettings
Visual C++
public:
AnalysisDisplayLegendSettings^ GetLegendSettings()
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace